app/Services/AppointmentService.php

insert into `appointment_user` (`appointment_id`, `user_id`) values (7, 4)
---
  public function performAppointmentRelatedTasks($project,$appointment)
  {
    $appointment->users()->attach(request('user'));

insert into `appointment_user` (`appointment_id`, `user_id`) values (7, 4)
delete from `appointment_user` where `appointment_id` = 7 and `user_id` in (4)
---
  protected function attachDetachUser($project,$request,$appointment)
  {
    if($request->filled('user')){

      $appointment->users()->attach(request('user'));

      $this->RecordActivity($project,'userattach_appointment');

      if ($appointment->users->contains(request('user'))) {

      $appointment->users()->detach(request('user'));