app/Appointment.php

delete from `appointment_user` where `appointment_id` = 7
---
  protected static function boot()
    {
     parent::boot();
     static::deleting(function($appointment) {
        $appointment->users()->detach();