app/Http/Controllers/AppointmentController.php

  public function index(Project $project,Request $request)
  {
    return  $project->appointments()->with('users')->get();
---
select * from `appointments` where `appointments`.`project_id` = 10 and `appointments`.`project_id` is not null
select `users`.*, `appointment_user`.`appointment_id` as `pivot_appointment_id`, `appointment_user`.`user_id` as `pivot_user_id` from `users` inner join `appointment_user` on `users`.`id` = `appointment_user`.`user_id` where `appointment_user`.`appointment_id` in (3)