app/Http/Controllers/ConversationController.php

select * from `conversations` where `conversations`.`group_id` = 5 and `conversations`.`group_id` is not null
select * from `groups` where `groups`.`id` = 5 limit 1
select * from `users` where `users`.`id` in (3)
---
    public function conversation(Project $project)
    {
      return $project->group->conversations->load('user');