app/Http/Controllers/FeaturesController.php

     public function stage(Project $project,Request $request)
     {
      $this->validate($request, [
          'stage'=>'required',
      ]);

      $project->update(request(['stage']));
---
update `projects` set `stage` = 3, `projects`.`updated_at` = '2021-04-29 21:18:46' where `id` = 10