app/Http/Controllers/HomeController.php

select * from `users` order by `created_at` desc
---
    public function users()
    {
        return User::latest()->get();