app/Http/Controllers/ProfileController.php

select exists(select * from `paypals` where `user_id` = 3) as `exists`
---
  public function show(User $user)
  {
   $members=$user->members;

   //Get user paypal subscription status
   if(Paypal::where('user_id',$user->id)->exists())

update `users` set `avatar_path` = 'https://crm-fresh.s3.ap-south-1.amazonaws.com/3_608dc4fa0de22.', `users`.`updated_at` = '2021-05-01 21:15:43' where `id` = 3
---
  public function avatarDelete(User $user)
  {
    if($user->avatar_path!==null)
    {
      $user->update(['avatar_path'=>null]);

update `users` set `bio` = 'Donec a semper urna, ac semper dui. Sed pulvinar rutrum dapibus. Phasellus suscipit turpis id lectus interdum, non vestibulum tellus porttitor. Aliquam dignissim, lorem at mattis cursus, velit nisl condimentum sapien, quis ullamcorper nisi quam id leo. Nunc quis tristique nulla. Fusce hendrerit, ligula sit amet hendrerit vestibulum, est nulla sodales nisi, consectetur pretium nulla neque vitae neque. Nunc imperdiet ornare magna vitae mattis. In scelerisque consequat varius. Suspendisse luctus sem id magna consequat maximus.', `users`.`updated_at` = '2021-04-30 20:12:50' where `id` = 3
---
  public function update(UserRequest $request,User $user)
  {
    $user->update($request->validated());