app/Http/Controllers/ProjectController.php

update `projects` set `deleted_at` = '2021-04-30 20:56:19', `projects`.`updated_at` = '2021-04-30 20:56:19' where `id` = 10
---
    public function update(Project $project,ProjectRequest $request)
    {
        $this->authorize('access',$project);

        $project->update($request->validated());