app/Http/Controllers/TaskController.php

  public function index(Project $project)
  {
    return $project->tasks()->latest()->get();
---
select * from `tasks` where `tasks`.`project_id` = 10 and `tasks`.`project_id` is not null order by `created_at` desc

  public function destroy(Project $project,Task $task)
  {
    $task->delete();
---
delete from `tasks` where `id` = 3